# GetVPClOvrdFillStyle

```pascal
FUNCTION GetVPClOvrdFillStyle(
				viewportHandle : HANDLE;
				className      : STRING): LONGINT;
```

```python
def vs.GetVPClOvrdFillStyle(viewportHandle, className):
    return LONGINT
```

## Parameters
|Name|Type|Description|
|---|---|---|
|viewportHandle|HANDLE|The viewport Handle|
|className|STRING|The name of the class override|

## Version
Availability: from Vectorworks 2018

## Category
* Viewports